import type { FAQItem } from "@/types/components";

export const FAQS_LIST: FAQItem[] = [
  {
    question: "آیا برنامه تمرینی پس از ارزیابی اولیه ارائه می‌شود؟",
    answer:
      "برای شروع، کافی است هدف و شرایط خود را مشخص کنید. سپس بر اساس اطلاعاتی که وارد می‌کنید و ارزیابی‌های صورت گرفته توسط مربی، برنامه‌ای متناسب با سطح و نیاز شما طراحی می‌شود و می‌توانید مسیر تمرینی خود را آغاز کنید.",
  },
  {
    question: "آیا برنامه غذایی هم ارائه می‌شود؟",
    answer:
      "با توجه به پکیج شما، برنامه غذایی متناسب با نیازهای فردی شما ارائه می‌شود.",
  },
  {
    question: "آیا پشتیبانی مربی برای تمام دوره‌ها است؟",
    answer:
      "بله، یکی از نکات مهم استارفیت، پشتیبانی از ورزشکاران در طول دوره است.",
  },
  {
    question: "آیا امکان ارسال ویدئو برای مربی وجود دارد؟",
    answer:
      "بله، می‌توانید ویدیو اجرای تمرینات خود را ارسال کنید تا توسط مربی بررسی شده و بازخورد لازم برای ادامه کار را دریافت کنید.",
  },
];

